tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    "(region0_to.*)"
    {
        type            mapped;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
        field           Usf;
        average         (0 0 0);
        setAverage      no;
    }
}


// ************************************************************************* //
